---
kind: other
id: Methods.T:Autodesk.Revit.DB.SketchBase
source: html/94a02423-a3f1-8d6c-7be6-f5729ba95399.htm
---
# SketchBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.